Repository: LawrenceLiang02/WondaCabinetInc_FrontEnd
Catalog: src/translate/messages.*.xlf
Languages: fr

source: Reference Name
fr: Nom de Référence

source: Kitchen
fr: Cuisine

source: Color (please reference to <a href="https://www.benjaminmoore.com/en-ca/colour-overview" target="_blank" >BenjaminMoore</a> catalog)
fr: Couleur (veuillez faire référence au catalogue de <a href="https://www.benjaminmoore.com/en-ca/colour-overview" target="_blank" >BenjaminMoore</a>)

source: Material
fr: Matériel

source: Oak
fr: Chêne

source: Maple
fr: Érable

source: Medium-density fibreboard
fr: Fibre à densité moyenne (MDF)

source: Select a handle
fr: Choisir la poignée

source: Square
fr: Rectangulaire

source: Round
fr: Circulaire

source: Knob
fr: Bouton

source: Email
fr: Courriel

source: Address
fr: Addresse

source: City
fr: Vile

source: Additional Items
fr: Eléments supplémentaires

source: E.g. Lazy Suzan, Spice Rack
fr: Ex. Plateau tournant, Carousel d'épice

source: Submit
fr: Envoyer

source: Request Specifications About Your Orders
fr: Raison de la demande

source: Cancellation Request
fr: Demande de l'annulation

source: Tracking No
fr: Numéro de suivi

source: Tracking Number is required!
fr: Le numéro de suivi est obligatoire!

source: Extra Specifications to Cancellation
fr: Plus de détail par rapport à l'annulation

source: Enter cancellation specifications here.
fr: Entrer les détails de l'annulation ici.

source: Send Request
fr: Envoyer la demande

source: Email could not be sent due to: {{ errorMessage }}
fr: Le courriel n'a pas été envoyé. Raison: {{ errorMessage }}

source: Email sent to staff. <a routerLink="/">Back to Home</a>
fr: Courriel envoyé à l'équipe <a routerLink="/">Retourner à la page d'accueil</a>

source: Contact Us
fr: Nous Rejoindre

source: Our Services are open from Monday to friday from 8:00AM to 5:30PM Eastern time.
fr: Nous sommes ouvert du Lundi à Vendredi de 8:00 à 17:30.

source: Phone:
fr: Téléphone:

source: You can also visit our offices
fr: Vous pouvez venir nous visiter en personne

source: DELIVERY
fr: LIVRAISON

source: Choose a date
fr: Choisir une date

source: Cancel
fr: Retourner

source: Select
fr: Choisir

source: DELETE
fr: SUPPRIMER

source: Are you sure you want to delete this order? You can not undo this action. If you wish to keep this in the records, please change the status to "cancelled".
fr: Êtes-vous sûr de vouloir supprimer cette commande? Cette action n'est pas réversible. Si vous voulez garder des traces de cette commande, veuillez changer le statut de la commande à "cancelled".

source: Delete
fr: Supprimer

source: Please enter your password in order to continue.
fr: Veuillez entrer votre mot de passe pour continuer.

source: Error, please try again.
fr: Erreur, veuillez réessayer.

source: Login failed: {{ errorMessage }}
fr: Connexion échoué: {{ errorMessage }}

source: Made by Lawrence Liang and Vlad Popa from Champlain College St-Lambert
fr: Projet réalisé par Lawrence Liang et Vlad Popa du CÉGEP Champlain St-Lambert

source: Reset your Password
fr: Réinitialiser votre Mot de Passe

source: Get a password token to reset your password and then set your new password
fr: Entrez votre code de réinitialisation et entrez un nouveau mot de passe.

source: example@email.com
fr: exemple@email.com

source: Email is required!
fr: Le courriel est requis!

source: Send Password Token Email
fr: Envoyer le courriel de réinitialisation.

source: Token could not be sent due to: {{ errorMessage }}
fr: Le courriel n'a pas été envoyé: {{ errorMessage }}

source: Token sent to {{ form.email }}.
fr: Courriel envoyé à {{ form.email }}.

source: Password Token
fr: Code de réinitialisation

source: password token received from email
fr: code de réinitialisation reçu du courriel

source: Token is required!
fr: Code de réinitialisation requis!

source: New Password
fr: Nouveau mot de passe

source: New Password is required
fr: Mot de Passe requis!

source: Password must be at least 6 characters
fr: Le mot de passe doit être minimum de 6 charactères.

source: {{ form2.passwordToken }} Password Update failed due to: {{ errorMessage }}
fr: {{ form2.passwordToken }} Réinitialisation de mot de passe échoué: {{ errorMessage }}

source: Reset Password
fr: Réinitialiser votre Mot de Passe

source: Password updated successfully. <a routerLink="/login" style="font-size: 150%">Back To Login</a>
fr: Mot de Passe réinitalisé. <a routerLink="/login" style="font-size: 150%">Retourner à la page de connnection</a>

source: Home
fr: Page d'Accueil

source: View Orders
fr: Vos Commandes

source: Order Now
fr: Commander

source: Track Your Order
fr: Suivre votre Commande

source: Request an Update
fr: Demander une mise à jour

source: Log In
fr: Se Connecter

source: Welcome, {{ username }}
fr: Bienvenue, {{ username }}

source: Log Out
fr: Déconnexion

source: Bathroom
fr: Salle de Bain

source: Previous
fr: Précédent

source: Next
fr: Prochain

source: Welcome to Wonda Cabinet Inc
fr: Bienvenue à Wonda Cabinet Inc

source: Login
fr: Se connecter

source: Username
fr: Nom d'utilisateur

source: exampleuser
fr: Nom d'Utilisateur

source: Username is required!
fr: Le Nom d'Utilisateur est obligatoire!

source: Password
fr: Mot de Passe

source: Password is required
fr: Le Mot de Passe est obligatoire!

source: Forgot Password
fr: Mot de Passe oublié

source: Logged in as {{ roles }}. <a href="/home">Continue</a>
fr: Conntecté en que: {{ roles }}. <a href="/home">Continuer</a>

source: Don't have an account?
fr: Vous n'avez pas de compte?

source: Sign Up For Free
fr: S'Enregistrer Gratuitement

source: Continue as Guest
fr: Continuez sans Compte

source: Order Details
fr: Détails de la Commande

source: Tracking Number:
fr: Numéro de suivi

source: Status:
fr: Statut:

source: Name:
fr: Nom de Référence:

source: Color:
fr: Couleur

source: Material:
fr: Matériel:

source: Handle Type:
fr: Type de poignée

source: City:
fr: Ville:

source: Delivery Date:
fr: Date de Livraison:

source: Sign Up Now For Free
fr: S'Enregistrer Gratuitement

source: First Name
fr: Prénom

source: foo
fr: Prénom

source: First Name is required
fr: Le Prénom est obligatoire!

source: First Name must be at least 2 characters
fr: Le Prénom doit contenir au moins 2 chractères

source: First Name must be at most 50 characters
fr: Le Prénom ne peut pas dépasser 50 charactères

source: Last Name
fr: Nom

source: bar
fr: Nom

source: Last Name must be at least 2 characters
fr: Le Nom doit contenir au moins 2 chractères

source: Last Name must be at most 50 characters
fr: Le Nom ne peut pas dépasser 50 charactères

source: Phone Number
fr: Numéro de Téléphone

source: Phone Number is required
fr: Le Numéro de Téléphone est requis!

source: Incorrect phone format! Must be like 123-456-7890
fr: Mauvais format du Numéro de Téléphone! 123-456-7890

source: Username is required
fr: Nom d'utilisateur est obligatoire

source: Username must be at least 3 characters
fr: Le Nom d'Utilisateur doit contenir au moins 3 charactères

source: exampleuser@example.com
fr: exemple@email.com

source: Email is required
fr: Le courriel est obligatoire!

source: Email must be a valid email address
fr: Le courriel doit être valide

source: Sign Up
fr: S'Enregistrer

source: Signup failed!<br />{{ errorMessage }}
fr: Enregistrement Échoué: <br />{{ errorMessage }}

source: Back to Login
fr: Retourner à la page de Connexion

source: Your registration is successful! <a routerLink="/login" style="font-size: 150%"style="font-size: 150%">Back to Login</a>
fr: Enregistrement réussi! <a routerLink="/login" style="font-size: 150%"style="font-size: 150%">Retourner à la Page de Connexion</a><

source: Order Satus
fr: Statut de la commande

source: Link to Design (PDF)
fr: Lien au Plan (PDF)

source: Design
fr: Plan

source: Update Request
fr: Demande de Modification

source: Specify Modifications to your order
fr: Modification nécessaire à votre commande

source: Enter update specifications here.
fr: Entrer les modifications ici.

source: Body is required!
fr: Le contenue est obligatoire!

source: Track your order!
fr: Suivre votre commande!

source: Track your order by entering your order tracking number!
fr: Suivre votre commande en entrant votre numéro de suivi!

source: Tracking Number
fr: Numéro de Suivi

source: Track
fr: Chercher

source: Here is the found order
fr: Voici votre commande:

source: Tracking Number: {{order.trackingNo}}
fr: Numéro de Suivi: {{order.trackingNo}}

source: Status: {{order.orderStatus}}
fr: Statut: {{order.orderStatus}}

source: Uh oh, can't seem to find your order.
fr: Oh non, votre commande n'a pas été trouvé.

source: This is what we got: {{ errorMessage }}
fr: Voici nos résultats: {{ errorMessage }}

source: Please check your tracking number and try again.
fr: Veuillez vérifier votre numéro de suivi et réessaillez.

source: Active Orders
fr: Commandes Actives

source: Order Status
fr: Statut de la Commande

source: Details
fr: Détails

source: Update
fr: Modifier

source: Delivery
fr: Livraison

source: Cancelled Orders
fr: Commandes Annulées

source: All Orders
fr: Toutes les Commandes
